export const MESSAGES = {
    startMessage: (name: string) => [
        `Привіт, <b>${name}</b>!`,
        `Мене звуть - <b>Вотермарка 💦</b>, і я допоможу тобі додавати водяний знак на твої файли.`,
        `Просто пришли мені картинку або відео, і я відправлю у відповіть з вотермаркою`]
        .join('\n\n'),

    unSupportType: () => `Вибач, я ще не вмію обробляти такі повідомленя, я тільки вчуся 😘`,

    unknownFileId: () => [
        `Не вдалося визначити file Id`,
        `звернись до адміна, будь ласка`
    ].join('\n\n'),

    unknownFileUrl: () => [
        `Не вдалося визначити file url`,
        `звернись до адміна, будь ласка`
    ].join('\n\n'),

    proceeding: () => `Обробка...`,

    positioning: (position: string) => `Застосування: ${position}`,

}
